<h1 align = center> SQL Joins </h1>
<h4 align = center> Facilitator: Kelvin Oyanna</h4>
<h4 align = center> Email: dotkelplus@gmail.com</h4>

In the previous lessons, we've only been working with one table at a time. The real power of SQL, however, comes from working with data from multiple tables at once. In this lesson we will learn the various SQL join operations for combining data from multiple tables.

JOINS are performed using the JOIN keyword to initiate the join, the ON keyword to specify the join condition (where the primary and foreign keys of the tables involved are equal) and the join type(e.g INNER, OUTER).

### Load Ipython SQL

In [13]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
#pip install ipython-sql

In [6]:
#pip install ipython

In [8]:
#pip install sqlalchemy

In [10]:
#pip install psycopg2-binary

In [12]:
#pip install pgspecial

### Connect to the dvdrental database from the last lesson

In [18]:
%sql select * from customer limit 10

 * postgresql://chris:***@localhost/dvdrental
10 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (2, 1, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (3, 1, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (4, 2, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (5, 1, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (6, 2, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', 10, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (7, 1, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (8, 2, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (9, 2, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', 13, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [19]:
%sql select * from address limit 10

 * postgresql://chris:***@localhost/dvdrental
10 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (6, '1121 Loja Avenue', '', 'California', 449, '17886', '838635286649', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (7, '692 Joliet Street', '', 'Attika', 38, '83579', '448477190408', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (8, '1566 Inegl Manor', '', 'Mandalay', 349, '53561', '705814003527', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (9, '53 Idfu Parkway', '', 'Nantou', 361, '42399', '10655648674', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (10, '1795 Santiago de Compostela Way', '', 'Texas', 295, '18743', '860452626434', datetime.datetime(2006, 2, 15, 9, 45, 30))]

In [16]:
# We're connecting to the PostgreSQL database using the PostgreSQL connection string
# The PostgreSQL string is in this format: %sql dialect+driver://username:password@host:port/databaseName

%sql postgresql://chris:admin1234@localhost/dvdrental

## SQL Inner Joins
The INNER JOIN operations returns a result where the join condition is satisfied (TRUE) in the tables involved. The Inner Join is also simply called the JOIN statement.

The image below illustrates the Inner join operation:

<img src = "inner_join.png" alt = "inner_join" width = "400" height = "150"/>

## Example
Let's get the address information of each customers. To achieve this, will join the customer and the address table.

In [24]:
%%sql SELECT cs.address_id, ad.address_id, first_name, last_name, address, district
FROM customer cs
JOIN address ad
ON cs.address_id = ad.address_id
LIMIT 5

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[(5, 5, 'Mary', 'Smith', '1913 Hanoi Way', 'Nagasaki'),
 (6, 6, 'Patricia', 'Johnson', '1121 Loja Avenue', 'California'),
 (7, 7, 'Linda', 'Williams', '692 Joliet Street', 'Attika'),
 (8, 8, 'Barbara', 'Jones', '1566 Inegl Manor', 'Mandalay'),
 (9, 9, 'Elizabeth', 'Brown', '53 Idfu Parkway', 'Nantou')]

In the above query, we only selected the columns (first_name, last_name, address, district) from both tables, that we want included in the result. We can also specify the dot star (.*) symbol on the table after the FROM statement to return all the columns for that table.

In the query below, we selected on the first_name and last_name columns from the customer table but selected all the columns from the address table:

In [25]:
%%sql SELECT first_name, last_name, ad.*
FROM customer cs
JOIN address ad
ON cs.address_id = ad.address_id
LIMIT 5

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[('Mary', 'Smith', 5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Patricia', 'Johnson', 6, '1121 Loja Avenue', '', 'California', 449, '17886', '838635286649', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Linda', 'Williams', 7, '692 Joliet Street', '', 'Attika', 38, '83579', '448477190408', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Barbara', 'Jones', 8, '1566 Inegl Manor', '', 'Mandalay', 349, '53561', '705814003527', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Elizabeth', 'Brown', 9, '53 Idfu Parkway', '', 'Nantou', 361, '42399', '10655648674', datetime.datetime(2006, 2, 15, 9, 45, 30))]

## The "USING" Keyword with JOINS
In some cases, the primary and foreign keys of the tables to be joined will be the same. In this instance, the USING keyword is used to simplyfy the query. Let's see an example of this below:

In [26]:
%%sql SELECT first_name, last_name, ad.*
FROM customer
JOIN address ad
USING(address_id)
LIMIT 5

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[('Mary', 'Smith', 5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Patricia', 'Johnson', 6, '1121 Loja Avenue', '', 'California', 449, '17886', '838635286649', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Linda', 'Williams', 7, '692 Joliet Street', '', 'Attika', 38, '83579', '448477190408', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Barbara', 'Jones', 8, '1566 Inegl Manor', '', 'Mandalay', 349, '53561', '705814003527', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 ('Elizabeth', 'Brown', 9, '53 Idfu Parkway', '', 'Nantou', 361, '42399', '10655648674', datetime.datetime(2006, 2, 15, 9, 45, 30))]

## SQL Outer Joins
When performing an inner join, rows from either table that are unmatched in the other table are not returned. In an outer join, unmatched rows in one or both tables can be returned. There are a few types of outer joins:


    - LEFT JOIN
    - RIGHT JOIN
    - FULL OUTER JOIN

## Left Outer Join (Left Join)
The left Outer Join returns unmatched rows from the left table and the matched rows from both tables. The umatched rows in the right table is filled with NULL values.

The image below illustrates a Left Outer Join:

<img src = "left_outer_join.png" alt = "inner_join" width = "400" height = "150"/>

To illustrate the Left Outer join, we will add new customers to the customer table. We assume these customers are yet to rent a film or make payment for a rental service. This means these customers will not have any entry in the payment table.

In [27]:
%%sql 
INSERT INTO customer VALUES (600, 2, 'Daniel', 'Jones', 'jonesd@sakilacustomer.org', 9, False, '2006-02-14', '2013-05-26 14:40:45.738000', 0);
INSERT INTO customer VALUES (601, 1, 'Oliver', 'Mensa', 'olivem@sakilacustomer.org', 4, False, '2006-02-14', '2013-05-26 14:30:45.738000', 0);
INSERT INTO customer VALUES (615, 2, 'Derick', 'Barbs', 'derickb@sakilacustomer.org', 6, False, '2006-03-14', '2013-05-26 15:40:45.738000', 0);
INSERT INTO customer VALUES (618, 1, 'Boby', 'Taylor', 'bobyt@sakilacustomer.org', 5, False, '2006-03-14', '2013-05-26 14:40:45.738000', 0);
INSERT INTO customer VALUES (625, 2, 'Frank', 'Jordan', 'frankj@sakilacustomer.org', 15, False, '2006-02-14', '2013-05-26 14:20:45.738000', 0);

 * postgresql://chris:***@localhost/dvdrental
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Now, let's get the result of a LEFT OUTER JOIN operation of the customer and the payment table. Note that the LEFT OUTER JOIN is the same as the LEFT JOIN. so WE can use them interchangeably.

In [31]:
%%sql
SELECT cs.customer_id, first_name, last_name, payment_id, amount, payment_date, py.customer_id as payment_cust_id
FROM customer cs
LEFT JOIN payment py
USING(customer_id)
where py.payment_id is null
ORDER BY cs.customer_id DESC

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[(625, 'Frank', 'Jordan', None, None, None, None),
 (618, 'Boby', 'Taylor', None, None, None, None),
 (615, 'Derick', 'Barbs', None, None, None, None),
 (601, 'Oliver', 'Mensa', None, None, None, None),
 (600, 'Daniel', 'Jones', None, None, None, None)]

## Right Outer Join (Right Join)
The Right Outer Join is the reverse of the Left Outer Join. It returns unmatched rows from the right table and the matched rows from both table. The umatched rows in the left table is filled with NULL values.

The image below illustrates the Right Outer Join:

<img src = "right_outer_join.png" alt = "inner_join" width = "470" height = "150"/>

To illustrate the Right Outer join, we will add new rental transactions to the rental table. We assume that the rental transactions are yet to be paid for, so, there are no equivalent entry of payment for the transactions in the payment table.

In [32]:
%%sql
INSERT INTO rental VALUES (17000, '2005-05-24 23:03:40', 12, 5, '2005-06-01 22:12:39', 2, '2006-03-10 02:30:53');
INSERT INTO rental VALUES (17001, '2005-05-24 23:03:40', 15, 6, '2005-06-01 22:12:39', 1, '2006-03-10 02:30:53');
INSERT INTO rental VALUES (17002, '2005-02-24 23:03:40', 22, 7, '2005-08-01 22:12:39', 2, '2006-09-10 02:30:53');
INSERT INTO rental VALUES (17003, '2005-01-24 23:03:40', 7, 8, '2005-07-01 22:12:39', 1, '2006-08-10 02:30:53');

 * postgresql://chris:***@localhost/dvdrental
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "rental_pkey"
DETAIL:  Key (rental_id)=(17000) already exists.

[SQL: INSERT INTO rental VALUES (17000, '2005-05-24 23:03:40', 12, 5, '2005-06-01 22:12:39', 2, '2006-03-10 02:30:53');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Now, let's get the result of a RIGHT OUTER JOIN (RIGHT JOIN) operation of the rental and the payment table.

In [35]:
%%sql
SELECT p.rental_id as payment_rental_id, amount, payment_date, return_date,  r.rental_id as rental_rental_id
FROM payment p
RIGHT JOIN rental r
USING(rental_id)
ORDER BY r.rental_id DESC
LIMIT 10

 * postgresql://chris:***@localhost/dvdrental
10 rows affected.

[(None, None, None, datetime.datetime(2021, 8, 21, 10, 27, 22), 17001),
 (None, None, None, datetime.datetime(2021, 8, 21, 10, 27, 22), 17000),
 (16049, Decimal('3.99'), datetime.datetime(2007, 3, 23, 21, 18, 38, 996577), datetime.datetime(2005, 8, 30, 1, 1, 12), 16049),
 (16048, Decimal('8.99'), datetime.datetime(2007, 3, 23, 21, 11, 33, 996577), datetime.datetime(2005, 8, 31, 21, 33, 7), 16048),
 (16047, Decimal('0.99'), datetime.datetime(2007, 3, 23, 21, 11, 14, 996577), datetime.datetime(2005, 8, 25, 2, 48, 48), 16047),
 (16046, Decimal('0.99'), datetime.datetime(2007, 3, 23, 20, 55, 13, 996577), datetime.datetime(2005, 8, 27, 18, 2, 47), 16046),
 (16045, Decimal('0.99'), datetime.datetime(2007, 3, 23, 20, 53, 52, 996577), datetime.datetime(2005, 8, 25, 23, 54, 26), 16045),
 (16044, Decimal('0.99'), datetime.datetime(2007, 3, 23, 20, 53, 5, 996577), datetime.datetime(2005, 8, 25, 4, 8, 39), 16044),
 (16043, Decimal('9.99'), datetime.datetime(2007, 3, 23, 20, 49, 29, 996577), datetime.datetime(2005, 8, 31, 3, 9, 3), 16043),
 (16042, Decimal('2.99'), datetime.datetime(2007, 3, 23, 20, 49, 6, 996577), datetime.datetime(2005, 8, 24, 17, 54, 40), 16042)]

## Full Outer Join
The full outer join or full join returns a result set that contains all rows from both left and right tables, with the matching rows from both sides if available. In case there is no match, the columns of the table will be filled with NULL.

The image below illustrates the Full Join:

<img src = "full_join.png" alt = "inner_join" width = "470" height = "150"/>

Now, let's get the result of a FULL OUTER JOIN operation of the customer and the rental table.

In [36]:
%%sql
SELECT c.customer_id as cust_customer_id, first_name, last_name, r.customer_id as rental_customer_id, return_date
FROM customer c
FULL JOIN rental r
USING(customer_id)
ORDER BY c.customer_id DESC
LIMIT 10

 * postgresql://chris:***@localhost/dvdrental
10 rows affected.

[(625, 'Frank', 'Jordan', None, None),
 (618, 'Boby', 'Taylor', None, None),
 (615, 'Derick', 'Barbs', None, None),
 (601, 'Oliver', 'Mensa', None, None),
 (600, 'Daniel', 'Jones', None, None),
 (599, 'Austin', 'Cintron', 599, datetime.datetime(2005, 6, 29, 14, 16, 35)),
 (599, 'Austin', 'Cintron', 599, datetime.datetime(2005, 7, 21, 20, 32, 56)),
 (599, 'Austin', 'Cintron', 599, datetime.datetime(2005, 7, 19, 20, 47, 59)),
 (599, 'Austin', 'Cintron', 599, datetime.datetime(2005, 6, 30, 17, 28, 5)),
 (599, 'Austin', 'Cintron', 599, datetime.datetime(2005, 7, 12, 8, 55))]

## Self Join
A self-join is a regular join that joins a table to itself. In practice, you typically use a self-join to query hierarchical data or to compare rows within the same table.

To perform a self-join, you specify the same table twice with different table aliases and provide the join predicate after the ON keyword.
To illustrate the Self Join, let's finds all pair of films that have the same length.

In [38]:
%sql select * from film limit 4

 * postgresql://chris:***@localhost/dvdrental
4 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2"),
 (8, 'Airport Pollock', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 1, 6, Decimal('4.99'), 54, Decimal('15.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'airport':1 'ancient':18 'confront':14 'epic':4 'girl':11 'india':19 'monkey':16 'moos':8 'must':13 'pollock':2 'tale':5"),
 (98, 'Bright Encounters', 'A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 2006, 1, 4, Decimal('4.99'), 73, Decimal('12.99'), 'PG-13', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'boat':20 'bright':1 'conquer':14 'encount':2 'fate':4 'feminist':11 'jet':19 'lumberjack':8 'must':13 'student':16 'yarn':5")]

In [41]:
%%sql
SELECT f1.title, f2.title, f1.length, f1.rental_rate
FROM film f1
INNER JOIN film f2 
ON f1.film_id = f2.film_id 
AND f1.length = f2.length
AND f1.rental_rate = f2.rental_rate
LIMIT 5

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[('Chamber Italian', 'Chamber Italian', 117, Decimal('4.99')),
 ('Grosse Wonderful', 'Grosse Wonderful', 49, Decimal('4.99')),
 ('Airport Pollock', 'Airport Pollock', 54, Decimal('4.99')),
 ('Bright Encounters', 'Bright Encounters', 73, Decimal('4.99')),
 ('Academy Dinosaur', 'Academy Dinosaur', 86, Decimal('0.99'))]